OpenNuvoton/NUC970_NonOS_BSP/Driver/Source/uart.c
/**************************************************************************//**
* @file     uart.c
* @version  V1.00
* $Revision: 6 $
* $Date: 15/06/10 11:59a $
* @brief    NUC970 UART driver source file
*
* @note
* Copyright (C) 2015 Nuvoton Technology Corp. All rights reserved.
*****************************************************************************/
#include <stdio.h>
#include <stdlib.h>
#include <string.h>
#include "nuc970.h"
#include "sys.h"
#include "uart.h"

/** @addtogroup NUC970_Device_Driver NUC970 Device Driver
  @{
*/

/** @addtogroup NUC970_UART_Driver UART Driver
  @{
*/

/** @addtogroup NUC970_UART_EXPORTED_CONSTANTS UART Exported Constants
  @{
*/

/*@}*/ /* end of group NUC970_UART_EXPORTED_CONSTANTS */

/// @cond HIDDEN_SYMBOLS

/*-----------------------------------------*/
/* marco, type and constant definitions    */
/*-----------------------------------------*/
/*
    Define debug level
*/
//#define UART_DEBUG
//#define UART_FLOWCONTROL_DEBUG
//#define UART1_DEBUG
//#define UART2_DEBUG

#ifdef UART_DEBUG
#define UDEBUG          sysprintf
#else
#define UDEBUG(...)
#endif  /* UART_DEBUG */

#ifdef UART_FLOWCONTROL_DEBUG
#define FDEBUG          sysprintf
#else
#define FDEBUG(...)
#endif  /* UART_FLOWCONTROL_DEBUG */

#ifdef UART1_DEBUG
#define U1DEBUG         sysprintf
#else
#define U1DEBUG(...)
#endif  /* UART1_DEBUG */

#ifdef UART2_DEBUG
#define U2DEBUG         sysprintf
#else
#define U2DEBUG(...)
#endif  /* UART1_DEBUG */

/*-----------------------------------------*/
/* global file scope (static) variables    */
/*-----------------------------------------*/
static UART_BUFFER_T UART_DEV[UART_NUM];

static UINT32 UARTTXBUFSIZE[UART_NUM] = {500, 500, 500, 500, 500, 500, 500, 500, 500, 500, 500};  /* UART0~10 Tx buffer size */
static UINT32 UARTRXBUFSIZE[UART_NUM] = {500, 500, 500, 500, 500, 500, 500, 500, 500, 500, 500};    /* UART0~10 Rx buffer size */


/*
    UART flag declarations.
*/
static volatile CHAR _uart_cDSRState0 = 0;   /* set 1, state change                         */
static volatile CHAR _uart_cDSRState1 = 0;   /* set 1, state change                         */
static volatile CHAR _uart_cDSRState2 = 0;   /* set 1, state change                         */
static volatile CHAR _uart_cDSRState3 = 0;   /* set 1, state change                         */
static volatile CHAR _uart_cDSRState4 = 0;   /* set 1, state change                         */
static volatile CHAR _uart_cDSRState5 = 0;   /* set 1, state change                         */
static volatile CHAR _uart_cDSRState6 = 0;   /* set 1, state change                         */
static volatile CHAR _uart_cDSRState7 = 0;   /* set 1, state change                         */
static volatile CHAR _uart_cDSRState8 = 0;   /* set 1, state change                         */
static volatile CHAR _uart_cDSRState9 = 0;   /* set 1, state change                         */
static volatile CHAR _uart_cDSRState10 = 0;   /* set 1, state change                         */
static volatile CHAR _uart_cBIIState_0 = 0;  /* set 1, UART channel 0 break interrupt occur */
static volatile CHAR _uart_cBIIState_1 = 0;  /* set 1, UART channel 1 break interrupt occur */
static volatile CHAR _uart_cBIIState_2 = 0;  /* set 1, UART channel 2 break interrupt occur */
static volatile CHAR _uart_cBIIState_3 = 0;  /* set 1, UART channel 3 break interrupt occur */
static volatile CHAR _uart_cBIIState_4 = 0;  /* set 1, UART channel 4 break interrupt occur */
static volatile CHAR _uart_cBIIState_5 = 0;  /* set 1, UART channel 0 break interrupt occur */
static volatile CHAR _uart_cBIIState_6 = 0;  /* set 1, UART channel 1 break interrupt occur */
static volatile CHAR _uart_cBIIState_7 = 0;  /* set 1, UART channel 2 break interrupt occur */
static volatile CHAR _uart_cBIIState_8 = 0;  /* set 1, UART channel 3 break interrupt occur */
static volatile CHAR _uart_cBIIState_9 = 0;  /* set 1, UART channel 4 break interrupt occur */
static volatile CHAR _uart_cBIIState_10 = 0;  /* set 1, UART channel 4 break interrupt occur */
static volatile CHAR _uart_cCTSState0 = 0;    /* set 1, state change                         */
static volatile CHAR _uart_cCTSState1 = 0;    /* set 1, state change                         */
static volatile CHAR _uart_cCTSState2 = 0;    /* set 1, state change                         */
static volatile CHAR _uart_cCTSState3 = 0;    /* set 1, state change                         */
static volatile CHAR _uart_cCTSState4 = 0;    /* set 1, state change                         */
static volatile CHAR _uart_cCTSState5 = 0;    /* set 1, state change                         */
static volatile CHAR _uart_cCTSState6 = 0;    /* set 1, state change                         */
static volatile CHAR _uart_cCTSState7 = 0;    /* set 1, state change                         */
static volatile CHAR _uart_cCTSState8 = 0;    /* set 1, state change                         */
static volatile CHAR _uart_cCTSState9 = 0;    /* set 1, state change                         */
static volatile CHAR _uart_cCTSState10 = 0;    /* set 1, state change                         */

/*
    Define flow control flags & parameters.
*/
#define HWFLOWCONTROL   1
#define SWFLOWCONTROL   2
static volatile CHAR _uart_cFlowControlMode = 0;  /* default no flow control */
static volatile CHAR _uart_cHWTXStopped = 0;      /* Use for H/W flow control. Set 1, stop TX. Set 0, start TX.   */
static volatile CHAR _uart_cHWRXStopped = 0;      /* Use for H/W flow control. Set 1, stop RX. Set 0, start RX.   */
static volatile CHAR _uart_cSWTXStopped = 0;      /* Use for S/W flow control. Set 1, rec Xoff. Set 0, rec Xon.   */
static volatile CHAR _uart_cSWRXStopped = 0;      /* Use for S/W flow control. Set 1, send Xoff. Set 0, send Xon. */
//static INT _uart_nMaxRxBuf = 0;                   /* used in uartReceiveChars() */
//static INT _uart_nMinRxBuf = 0;                   /* used in uartReadRxBuf()    */


/*-----------------------------------------*/
/* prototypes of static functions          */
/*-----------------------------------------*/
static UINT32 _uartTxBufGetNextOne(INT nNum, UINT32 uPointer);
static UINT32 _uartRxBufGetNextOne(INT nNum, UINT32 uPointer);
static void _uartEnableInterrupt(INT nNum, UINT32 uVal);
static void _uartDisableInterrupt(INT nNum, UINT32 uVal);
static void _uartReceiveChars(INT nNum);
static void _uartTransmitChars(INT nNum);
static void _uartCheckModemStatus(INT nNum);
static INT _uartSetBaudRate(INT nNum, UART_T *val);
static void _uartInstallISR(UINT8 ucNum);
static BOOL _uartBUFSpaceAlloc(INT nNum);
static BOOL _uartCheckTxBufSpace(INT nNum, UINT32 uHead, UINT32 uTail, UINT32 uLen);
static INT32 _uartReadRxBuf(INT nNum, PUINT8 pucBuf, UINT32 uLen);
static void _uartWriteTxBuf(INT nNum, PUINT8 pucBuf, UINT32 uLen);
static INT _uartConfigureUART(PVOID pvParam);
static INT _uartPerformIrDA(INT nNum, UINT32 uCmd, UINT32 uCmd1);
static INT _uartGetRegisterValue(INT nNum, PVOID pvReg);


void RS485_HANDLE(INT nNum)
{
    UINT32 volatile uRegISR, uRegFSR, uRegALT_CSR;

    uRegISR = inpw(REG_UART0_ISR+(nNum*UARTOFFSET));
    uRegFSR = inpw(REG_UART0_FSR+(nNum*UARTOFFSET));

    if((uRegISR & UART_ISR_RLS_IF_Msk) && (uRegISR & UART_ISR_RDA_IF_Msk))  /* RLS INT & RDA INT */  //For RS485 Detect Address
    {
        if(uRegFSR & UART_FSR_RS485_ADD_DETF_Msk) { /* ADD_IF, RS485 mode */
            _uartReceiveChars(nNum);
            outpw((REG_UART0_FSR+(nNum*UARTOFFSET)), UART_FSR_RS485_ADD_DETF_Msk);  /* clear ADD_IF flag */
        }
    } else if( uRegISR & (UART_ISR_RDA_IF_Msk | UART_ISR_TOUT_IF_Msk)) { /* Rx Ready or Time-out INT*/
        /* Handle received data */
        _uartReceiveChars(nNum);
    }

