OpenNuvoton/NUC970_NonOS_BSP/Driver/Source/uart.c
    if(uRegISR & UART_ISR_RLS_IF_Msk) {
        uRegFSR = inpw(REG_UART0_FSR+(nNum*UARTOFFSET));
        if(uRegFSR & UART_FSR_BIF_Msk)
            _uart_cBIIState_0 = 1;
    }
}

void LIN_HANDLE(INT nNum)
{
    UINT32 volatile uRegISR, uRegFSR, uRegLIN_SR, uRegALT_CSR;

    uRegISR = inpw(REG_UART0_ISR+(nNum*UARTOFFSET));
    uRegFSR = inpw(REG_UART0_FSR+(nNum*UARTOFFSET));
    uRegLIN_SR = inpw(REG_UART0_LIN_SR+(nNum*UARTOFFSET));

    if(uRegISR & UART_ISR_LIN_RX_BREAK_INT_Msk)
    {
        if(uRegLIN_SR & UART_LIN_SR_LINS_HDET_F_Msk)
        {
            // Clear LIN slave header detection flag
            outpw((REG_UART0_LIN_SR+(nNum*UARTOFFSET)), UART_LIN_SR_LINS_HDET_F_Msk);
            U1DEBUG("\n LIN Slave Header detected ");
        }

        if(uRegLIN_SR & (UART_LIN_SR_LINS_HERR_F_Msk | UART_LIN_SR_LINS_IDPERR_F_Msk | UART_LIN_SR_BIT_ERR_F_Msk))
        {
            // Clear LIN error flag
            uRegLIN_SR = (UART_LIN_SR_LINS_HERR_F_Msk | UART_LIN_SR_LINS_IDPERR_F_Msk | UART_LIN_SR_BIT_ERR_F_Msk);
            outpw((REG_UART0_LIN_SR+(nNum*UARTOFFSET)), uRegLIN_SR);
            U1DEBUG("\n LIN error detected ");
        }
    }

    if(uRegISR & (UART_ISR_RDA_IF_Msk | UART_ISR_TOUT_IF_Msk))
    {
        _uartReceiveChars(nNum);
    }

    if(uRegISR & UART_ISR_RLS_IF_Msk) {
        uRegFSR = inpw(REG_UART0_FSR+(nNum*UARTOFFSET));
        U1DEBUG("U1 Irpt_RLS [0x%x]!\n", uRegFSR);

        if(uRegFSR & UART_FSR_BIF_Msk)
            _uart_cBIIState_1 = 1;

        if (uRegFSR & UART_FSR_RX_OVER_IF_Msk)
            U1DEBUG("U1 OEI!\n");
    }

}

void uart0ISR(void)
{
    UINT32 volatile uRegISR, uRegFSR;

    uRegISR = inpw(REG_UART0_ISR) & 0xff;

    if(uRegISR & UART_ISR_THRE_IF_Msk)  /* TX empty interrupt, check LSR 4 kinds of error further */
        _uartTransmitChars(UART0);

    if( uRegISR & (UART_ISR_RDA_IF_Msk | UART_ISR_TOUT_IF_Msk)) /* Received Data Available interrupt */
        _uartReceiveChars(UART0);

    if(uRegISR & UART_ISR_RLS_IF_Msk) {
        uRegFSR = inpw(REG_UART0_FSR);
        if(uRegFSR & UART_FSR_BIF_Msk)
            _uart_cBIIState_0 = 1;
    }

}

void uart1ISR(void)
{
    UINT32 volatile uRegISR, uRegFSR, uRegMSR, uRegFUN_SEL;

    uRegISR = inpw(REG_UART1_ISR) & 0xff;
    uRegFUN_SEL = inpw(REG_UART1_FUN_SEL);

    if(uRegISR & UART_ISR_THRE_IF_Msk)  /* TX empty interrupt, check LSR 4 kinds of error further */
        _uartTransmitChars(UART1);

    if(uRegFUN_SEL == 0x3) {
        RS485_HANDLE(UART1);
    } else if(uRegFUN_SEL == 0x1){
        LIN_HANDLE(UART1);
    } else {
        if( uRegISR & (UART_ISR_RDA_IF_Msk | UART_ISR_TOUT_IF_Msk)) /* Received Data Available interrupt */
            _uartReceiveChars(UART1);

        if(uRegISR & UART_ISR_MODEM_IF_Msk) {
            if (_uart_cFlowControlMode == 0) {
                uRegMSR = inpw(REG_UART1_MSR);

                if (uRegMSR & 0x01)
                    _uart_cCTSState1 = 1;
            } else
                _uartCheckModemStatus(UART1);  /* H/W flow control */
        }

        if(uRegISR & UART_ISR_RLS_IF_Msk) {
            uRegFSR = inpw(REG_UART1_FSR);
            U1DEBUG("U1 Irpt_RLS [0x%x]!\n", uRegFSR);

            if(uRegFSR & UART_FSR_BIF_Msk)
                _uart_cBIIState_1 = 1;

            if (uRegFSR & UART_FSR_RX_OVER_IF_Msk)
                U1DEBUG("U1 OEI!\n");
        }
    }
}

void uart2ISR(void)
{
    UINT32 volatile uRegISR, uRegFSR, uRegMSR, uRegFUN_SEL;

    uRegISR = inpw(REG_UART2_ISR) & 0xff;
    uRegFUN_SEL = inpw(REG_UART2_FUN_SEL);

    if(uRegISR & UART_ISR_THRE_IF_Msk)  /* TX empty interrupt, check LSR 4 kinds of error further */
        _uartTransmitChars(UART2);

    if(uRegFUN_SEL == 0x3) {
        RS485_HANDLE(UART2);
    } else if(uRegFUN_SEL == 0x1){
        LIN_HANDLE(UART2);
    } else {
        if( uRegISR & (UART_ISR_RDA_IF_Msk | UART_ISR_TOUT_IF_Msk)) /* Received Data Available interrupt */
            _uartReceiveChars(UART2);

        if(uRegISR & UART_ISR_RLS_IF_Msk) {
            uRegFSR = inpw(REG_UART2_FSR);
            if(uRegFSR & UART_FSR_BIF_Msk)
                _uart_cBIIState_2 = 1;
        }

        if(uRegISR & UART_ISR_MODEM_IF_Msk) {
            if (_uart_cFlowControlMode == 0) {
                uRegMSR = inpw(REG_UART2_MSR);

                if (uRegMSR & 0x01)
                    _uart_cCTSState2 = 1;
            } else
                _uartCheckModemStatus(UART2);  /* H/W flow control */
        }

        if(uRegISR & UART_ISR_RLS_IF_Msk) {
            uRegFSR = inpw(REG_UART2_FSR);
            U1DEBUG("U2 Irpt_RLS [0x%x]!\n", uRegFSR);

            if(uRegFSR & UART_FSR_BIF_Msk)
                _uart_cBIIState_2 = 1;

            if (uRegFSR & UART_FSR_RX_OVER_IF_Msk)
                U1DEBUG("U2 OEI!\n");
        }
    }
}

void uart3ISR(void)
{
    UINT32 volatile uRegISR, uRegFSR, uRegMSR, uRegFUN_SEL;

    uRegISR = inpw(REG_UART3_ISR) & 0xff;
    uRegFUN_SEL = inpw(REG_UART3_FUN_SEL);

    if(uRegISR & UART_ISR_THRE_IF_Msk)  /* TX empty interrupt, check LSR 4 kinds of error further */
        _uartTransmitChars(UART3);

    if(uRegFUN_SEL == 0x3) {
        RS485_HANDLE(UART3);
    } else if(uRegFUN_SEL == 0x1){
        LIN_HANDLE(UART3);
    } else {
        if( uRegISR & (UART_ISR_RDA_IF_Msk | UART_ISR_TOUT_IF_Msk))
            _uartReceiveChars(UART3);

        if(uRegISR & UART_ISR_MODEM_IF_Msk) {
            if (_uart_cFlowControlMode == 0) {
                uRegMSR = inpw(REG_UART3_MSR);

                if (uRegMSR & 0x01)
                    _uart_cCTSState3 = 1;
            } else
                _uartCheckModemStatus(UART3);  /* H/W flow control */
        }

        if(uRegISR & UART_ISR_RLS_IF_Msk) {
            uRegFSR = inpw(REG_UART3_FSR);
            U1DEBUG("U3 Irpt_RLS [0x%x]!\n", uRegFSR);

            if(uRegFSR & UART_FSR_BIF_Msk)
                _uart_cBIIState_3 = 1;

            if (uRegFSR & UART_FSR_RX_OVER_IF_Msk)
                U1DEBUG("U3 OEI!\n");
        }
    }

}

void uart4ISR(void)
{
    UINT32 volatile uRegISR, uRegFSR, uRegMSR, uRegFUN_SEL;

    uRegISR = inpw(REG_UART4_ISR) & 0xff;
    uRegFUN_SEL = inpw(REG_UART4_FUN_SEL);

    if(uRegISR & UART_ISR_THRE_IF_Msk)  /* TX empty interrupt, check LSR 4 kinds of error further */
        _uartTransmitChars(UART4);

