OpenNuvoton/NUC970_NonOS_BSP/Driver/Source/uart.c
    if(uRegFUN_SEL == 0x3) {
        RS485_HANDLE(UART4);
    } else if(uRegFUN_SEL == 0x1){
        LIN_HANDLE(UART4);
    } else {
        if( uRegISR & (UART_ISR_RDA_IF_Msk | UART_ISR_TOUT_IF_Msk)) /* Received Data Available interrupt */
            _uartReceiveChars(UART4);

        if(uRegISR & UART_ISR_MODEM_IF_Msk) {
            if (_uart_cFlowControlMode == 0) {
                uRegMSR = inpw(REG_UART4_MSR);

                if (uRegMSR & 0x01)
                    _uart_cCTSState4 = 1;
            } else
                _uartCheckModemStatus(UART4);  /* H/W flow control */
        }

        if(uRegISR & UART_ISR_RLS_IF_Msk) {
            uRegFSR = inpw(REG_UART4_FSR);
            U1DEBUG("U4 Irpt_RLS [0x%x]!\n", uRegFSR);

            if(uRegFSR & UART_FSR_BIF_Msk)
                _uart_cBIIState_4 = 1;

            if (uRegFSR & UART_FSR_RX_OVER_IF_Msk)
                U1DEBUG("U4 OEI!\n");
        }
    }

}

void uart5ISR(void)
{
    UINT32 volatile uRegISR, uRegFSR, uRegMSR, uRegFUN_SEL;

    uRegISR = inpw(REG_UART5_ISR) & 0xff;
    uRegFUN_SEL = inpw(REG_UART5_FUN_SEL);

    if(uRegISR & UART_ISR_THRE_IF_Msk)  /* TX empty interrupt, check LSR 4 kinds of error further */
        _uartTransmitChars(UART5);

    if(uRegFUN_SEL == 0x3) {
        RS485_HANDLE(UART5);
    } else if(uRegFUN_SEL == 0x1){
        LIN_HANDLE(UART5);
    } else {
        if( uRegISR & (UART_ISR_RDA_IF_Msk | UART_ISR_TOUT_IF_Msk)) /* Received Data Available interrupt */
            _uartReceiveChars(UART5);

        if(uRegISR & UART_ISR_MODEM_IF_Msk) {
            if (_uart_cFlowControlMode == 0) {
                uRegMSR = inpw(REG_UART5_MSR);

                if (uRegMSR & 0x01)
                    _uart_cCTSState5 = 1;
            } else
                _uartCheckModemStatus(UART5);  /* H/W flow control */
        }

        if(uRegISR & UART_ISR_RLS_IF_Msk) {
            uRegFSR = inpw(REG_UART5_FSR);
            U1DEBUG("U5 Irpt_RLS [0x%x]!\n", uRegFSR);

            if(uRegFSR & UART_FSR_BIF_Msk)
                _uart_cBIIState_5 = 1;

            if (uRegFSR & UART_FSR_RX_OVER_IF_Msk)
                U1DEBUG("U5 OEI!\n");
        }
    }

}

void uart6ISR(void)
{
    UINT32 volatile uRegISR, uRegFSR, uRegMSR, uRegFUN_SEL;

    uRegISR = inpw(REG_UART6_ISR) & 0xff;
    uRegFUN_SEL = inpw(REG_UART6_FUN_SEL);

    if(uRegISR & UART_ISR_THRE_IF_Msk)  /* TX empty interrupt, check LSR 4 kinds of error further */
        _uartTransmitChars(UART6);

    if(uRegFUN_SEL == 0x3) {
        RS485_HANDLE(UART6);
    } else if(uRegFUN_SEL == 0x1){
        LIN_HANDLE(UART6);
    } else {
        if( uRegISR & (UART_ISR_RDA_IF_Msk | UART_ISR_TOUT_IF_Msk)) /* Received Data Available interrupt */
            _uartReceiveChars(UART6);

        if(uRegISR & UART_ISR_MODEM_IF_Msk) {
            if (_uart_cFlowControlMode == 0) {
                uRegMSR = inpw(REG_UART6_MSR);

                if (uRegMSR & 0x01)
                    _uart_cCTSState6 = 1;
            } else
                _uartCheckModemStatus(UART6);  /* H/W flow control */
        }

        if(uRegISR & UART_ISR_RLS_IF_Msk) {
            uRegFSR = inpw(REG_UART6_FSR);
            U1DEBUG("U6 Irpt_RLS [0x%x]!\n", uRegFSR);

            if(uRegFSR & UART_FSR_BIF_Msk)
                _uart_cBIIState_6 = 1;

            if (uRegFSR & UART_FSR_RX_OVER_IF_Msk)
                U1DEBUG("U6 OEI!\n");
        }
    }

}

void uart7ISR(void)
{
    UINT32 volatile uRegISR, uRegFSR, uRegMSR, uRegFUN_SEL;

    uRegISR = inpw(REG_UART7_ISR) & 0xff;
    uRegFUN_SEL = inpw(REG_UART7_FUN_SEL);

    if(uRegISR & UART_ISR_THRE_IF_Msk)  /* TX empty interrupt, check LSR 4 kinds of error further */
        _uartTransmitChars(UART7);

    if(uRegFUN_SEL == 0x3) {
        RS485_HANDLE(UART7);
    } else if(uRegFUN_SEL == 0x1){
        LIN_HANDLE(UART7);
    } else {
        if( uRegISR & (UART_ISR_RDA_IF_Msk | UART_ISR_TOUT_IF_Msk)) /* Received Data Available interrupt */
            _uartReceiveChars(UART7);

        if(uRegISR & UART_ISR_MODEM_IF_Msk) {
            if (_uart_cFlowControlMode == 0) {
                uRegMSR = inpw(REG_UART7_MSR);

                if (uRegMSR & 0x01)
                    _uart_cCTSState7 = 1;
            } else
                _uartCheckModemStatus(UART7);  /* H/W flow control */
        }

        if(uRegISR & UART_ISR_RLS_IF_Msk) {
            uRegFSR = inpw(REG_UART7_FSR);
            U1DEBUG("U7 Irpt_RLS [0x%x]!\n", uRegFSR);

            if(uRegFSR & UART_FSR_BIF_Msk)
                _uart_cBIIState_7 = 1;

            if (uRegFSR & UART_FSR_RX_OVER_IF_Msk)
                U1DEBUG("U7 OEI!\n");
        }
    }

}

void uart8ISR(void)
{
    UINT32 volatile uRegISR, uRegFSR, uRegMSR, uRegFUN_SEL;

    uRegISR = inpw(REG_UART8_ISR) & 0xff;
    uRegFUN_SEL = inpw(REG_UART8_FUN_SEL);

    if(uRegISR & UART_ISR_THRE_IF_Msk)  /* TX empty interrupt, check LSR 4 kinds of error further */
        _uartTransmitChars(UART8);

    if(uRegFUN_SEL == 0x3) {
        RS485_HANDLE(UART8);
    } else if(uRegFUN_SEL == 0x1){
        LIN_HANDLE(UART8);
    } else {
        if( uRegISR & (UART_ISR_RDA_IF_Msk | UART_ISR_TOUT_IF_Msk)) /* Received Data Available interrupt */
            _uartReceiveChars(UART8);

        if(uRegISR & UART_ISR_MODEM_IF_Msk) {
            if (_uart_cFlowControlMode == 0) {
                uRegMSR = inpw(REG_UART8_MSR);

                if (uRegMSR & 0x01)
                    _uart_cCTSState8 = 1;
            } else
                _uartCheckModemStatus(UART8);  /* H/W flow control */
        }

        if(uRegISR & UART_ISR_RLS_IF_Msk) {
            uRegFSR = inpw(REG_UART8_FSR);
            U1DEBUG("U8 Irpt_RLS [0x%x]!\n", uRegFSR);

            if(uRegFSR & UART_FSR_BIF_Msk)
                _uart_cBIIState_8 = 1;

            if (uRegFSR & UART_FSR_RX_OVER_IF_Msk)
                U1DEBUG("U8 OEI!\n");
        }
    }

}

void uart9ISR(void)
{
    UINT32 volatile uRegISR, uRegFSR, uRegMSR, uRegFUN_SEL;

    uRegISR = inpw(REG_UART9_ISR) & 0xff;
    uRegFUN_SEL = inpw(REG_UART9_FUN_SEL);

    if(uRegISR & UART_ISR_THRE_IF_Msk)  /* TX empty interrupt, check LSR 4 kinds of error further */
        _uartTransmitChars(UART9);

