OpenNuvoton/NUC970_NonOS_BSP/Driver/Source/uart.c
    if(uRegFUN_SEL == 0x3) {
        RS485_HANDLE(UART9);
    } else if(uRegFUN_SEL == 0x1){
        LIN_HANDLE(UART9);
    } else {
        if( uRegISR & (UART_ISR_RDA_IF_Msk | UART_ISR_TOUT_IF_Msk))  /* Received Data Available interrupt */
            _uartReceiveChars(UART9);

        if(uRegISR & UART_ISR_MODEM_IF_Msk) {
            if (_uart_cFlowControlMode == 0) {
                uRegMSR = inpw(REG_UART9_MSR);

                if (uRegMSR & 0x01)
                    _uart_cCTSState9 = 1;
            } else
                _uartCheckModemStatus(UART9);  /* H/W flow control */
        }

        if(uRegISR & UART_ISR_RLS_IF_Msk) {
            uRegFSR = inpw(REG_UART9_FSR);
            U1DEBUG("U9 Irpt_RLS [0x%x]!\n", uRegFSR);

            if(uRegFSR & UART_FSR_BIF_Msk)
                _uart_cBIIState_9 = 1;

            if (uRegFSR & UART_FSR_RX_OVER_IF_Msk)
                U1DEBUG("U9 OEI!\n");
        }
    }

}

void uart10ISR(void)
{
    UINT32 volatile uRegISR, uRegFSR, uRegMSR, uRegFUN_SEL;

    uRegISR = inpw(REG_UARTA_ISR) & 0xff;
    uRegFUN_SEL = inpw(REG_UARTA_FUN_SEL);

    if(uRegISR & UART_ISR_THRE_IF_Msk)  /* TX empty interrupt, check LSR 4 kinds of error further */
        _uartTransmitChars(UARTA);

    if(uRegFUN_SEL == 0x3) {
        RS485_HANDLE(UARTA);
    } else if(uRegFUN_SEL == 0x1){
        LIN_HANDLE(UARTA);
    } else {
        if( uRegISR & (UART_ISR_RDA_IF_Msk | UART_ISR_TOUT_IF_Msk)) /* Received Data Available interrupt */
            _uartReceiveChars(UARTA);

        if(uRegISR & UART_ISR_MODEM_IF_Msk) {
            if (_uart_cFlowControlMode == 0) {
                uRegMSR = inpw(REG_UARTA_MSR);

                if (uRegMSR & 0x01)
                    _uart_cCTSState10 = 1;
            } else
                _uartCheckModemStatus(UARTA);  /* H/W flow control */
        }

        if(uRegISR & UART_ISR_RLS_IF_Msk) {
            uRegFSR = inpw(REG_UARTA_FSR);
            U1DEBUG("U10 Irpt_RLS [0x%x]!\n", uRegFSR);

            if(uRegFSR & UART_FSR_BIF_Msk)
                _uart_cBIIState_10 = 1;

            if (uRegFSR & UART_FSR_RX_OVER_IF_Msk)
                U1DEBUG("U10 OEI!\n");
        }
    }

}

static UINT32 _uartTxBufGetNextOne(INT nNum, UINT32 uPointer)
{
    if((uPointer + 1) == UARTTXBUFSIZE[nNum])
        return (UINT32)NULL;
    else
        return (uPointer + 1);
}

static UINT32 _uartRxBufGetNextOne(INT nNum, UINT32 uPointer)
{
    if((uPointer + 1) == UARTRXBUFSIZE[nNum])
        return (UINT32)NULL;
    else
        return (uPointer + 1);
}

static void _uartEnableInterrupt(INT nNum, UINT32 uVal)
{
    UINT32 uReg = 0;

    uReg = inpw(REG_UART0_IER+(nNum * UARTOFFSET));
    uReg |= uVal;
    outpw(REG_UART0_IER+(nNum * UARTOFFSET), uReg);
}

static void _uartDisableInterrupt(INT nNum, UINT32 uVal)
{
    UINT32 uReg = 0;

    if(uVal == DISABLEALLIER)
        outpw(REG_UART0_IER+(nNum * UARTOFFSET), 0);
    else {
        uReg = inpw(REG_UART0_IER+(nNum * UARTOFFSET));
        uReg &= ~uVal;
        outpw(REG_UART0_IER+(nNum * UARTOFFSET), uReg);
    }
}

static void _uartReceiveChars(INT nNum)
{
    //UINT32 volatile uRegLSR, uBuf = 0;
    UINT32 volatile uRegFSR, uRegALT_CSR, uRegFUN_SEL, uRegFCR, uRegLINSR, uRegISR;
    UINT32 volatile uBuf = 0;
    UINT32 volatile uOffset = nNum * UARTOFFSET;
    INT nMaxCount = 256;
    UCHAR ucChar;

    UART_BUFFER_T *dev;

    dev = (UART_BUFFER_T *) &UART_DEV[nNum];

    //uRegFSR = inpw(REG_UART0_FSR+(nNum * UARTOFFSET));
    uRegFUN_SEL = inpw(REG_UART0_FUN_SEL+uOffset);

    do {
        uRegFSR = inpw(REG_UART0_FSR+uOffset);
        uRegLINSR = inpw(REG_UART0_LIN_SR+uOffset);
        uRegISR = inpw(REG_UART0_ISR+uOffset);
        ucChar = inpb(REG_UART0_RBR+uOffset);

        if( (uRegFSR & UART_FSR_RS485_ADD_DETF_Msk) && (uRegFUN_SEL == 0x3) ) {
            uRegALT_CSR = inpw(REG_UART0_ALT_CSR+(nNum*UARTOFFSET));
            uRegFCR = inpw(REG_UART0_FCR+(nNum*UARTOFFSET));
            if( uRegALT_CSR & UART_ALT_CSR_RS485_NMM_Msk ) {
                if ( ucChar == (uRegALT_CSR >> UART_ALT_CSR_ADDR_MATCH_Pos)) {
                    uRegFCR &= ~UART_FCR_RX_DIS_Msk;  /* Enable RS485 RX */
                    outpw((REG_UART0_FCR+(nNum*UARTOFFSET)), uRegFCR);
                } else {
                    uRegFCR |= UART_FCR_RX_DIS_Msk;  /* Disable RS485 RX */
                    uRegFCR |= UART_FCR_RFR_Msk;  /* Clear data from RX FIFO */
                    outpw((REG_UART0_FCR+(nNum*UARTOFFSET)), uRegFCR);
                    break;
                }
            }
        }


        uBuf = _uartRxBufGetNextOne(nNum, dev->uUartRxTail);
        if(uBuf == dev->uUartRxHead) { /* Rx buffer full */
            //ucChar = inpb(REG_UART0_RBR+(nNum * UARTOFFSET));

            if (_uart_cHWRXStopped)
                U1DEBUG("[%d] buf full!\n", nNum);

            break;
        }

        //ucChar = inpb(REG_UART0_RBR+(nNum * UARTOFFSET));

        dev->pucUartRxBuf[dev->uUartRxTail] = ucChar;

        /* Check LSR for BII, FEI, PEI, OEI */
        dev->pucUARTFlag[dev->uUartRxTail] = 0;

        if(uRegFSR & UART_FSR_BIF_Msk) {
            dev->pucUARTFlag[dev->uUartRxTail] = UART_FSR_BIF_Msk;
            U1DEBUG("BIF!\n");
        } else if(uRegFSR & UART_FSR_FEF_Msk) {
            dev->pucUARTFlag[dev->uUartRxTail] = UART_FSR_FEF_Msk;
            U1DEBUG("FEF!\n");
        } else if(uRegFSR & UART_FSR_PEF_Msk) {
            dev->pucUARTFlag[dev->uUartRxTail] = UART_FSR_PEF_Msk;
            U1DEBUG("PEF!\n");
        } else if (uRegFSR & UART_FSR_RX_OVER_IF_Msk) {
            dev->pucUARTFlag[dev->uUartRxTail] = UART_FSR_RX_OVER_IF_Msk;
            U1DEBUG("OVER_IF!\n");
        } else if(uRegFSR & UART_FSR_RS485_ADD_DETF_Msk) {
            dev->pucUARTFlag[dev->uUartRxTail] = UART_FSR_RS485_ADD_DETF_Msk;
            U1DEBUG("RS485_ADD_DET_IF!\n");
        }

        if(uRegFUN_SEL == 0x1) {
            if(uRegISR & UART_ISR_LIN_RX_BREAK_IF_Msk) {
                dev->pucLINFlag[dev->uUartRxTail] = uRegLINSR;

                // Clear ISR and LIN Status
                outpw(REG_UART0_ISR, UART_ISR_LIN_RX_BREAK_IF_Msk);
                outpw(REG_UART0_LIN_SR, 0x30F);
            }
        }

        dev->uUartRxTail = _uartRxBufGetNextOne(nNum, dev->uUartRxTail);

        /* overrun error is special case, H/W ignore the character */
        if(uRegFSR & UART_FSR_RX_OVER_IF_Msk) {
            dev->pucUARTFlag[dev->uUartRxTail] = UART_FSR_RX_OVER_IF_Msk;
            dev->uUartRxTail = _uartRxBufGetNextOne(nNum, dev->uUartRxTail);
        }

        uRegFSR = inpw(REG_UART0_FSR+(nNum * UARTOFFSET));
    } while((!(uRegFSR & UART_FSR_RX_EMPTY_Msk)) && (nMaxCount-- > 0));

