OpenNuvoton/NUC970_NonOS_BSP/Driver/Source/uart.c
}

static void _uartTransmitChars(INT nNum)
{
    UINT32 volatile i;

    UART_BUFFER_T *dev;

    dev = (UART_BUFFER_T *) &UART_DEV[nNum];

    if(dev->uUartTxHead != dev->uUartTxTail) { /* buffer is not empty */
        for (i=0; i<8; i++) {
            outpw(REG_UART0_THR+(nNum * UARTOFFSET), dev->pucUartTxBuf[dev->uUartTxHead]);
            dev->uUartTxHead = _uartTxBufGetNextOne(nNum, dev->uUartTxHead);

            if(dev->uUartTxHead == dev->uUartTxTail) { /* buffer empty */
                _uartDisableInterrupt(nNum, UART_IER_THRE_IEN_Msk);
                break;
            }
        }
    }
}

/*
    Call by uart1ISR().
*/
static void _uartCheckModemStatus(INT nNum)
{
    UINT32 volatile uRegMSR;
    UINT32 uOffset = nNum * UARTOFFSET;

    UART_BUFFER_T *dev;

    dev = (UART_BUFFER_T *) &UART_DEV[nNum];

    FDEBUG("\n Modem INT\n");
    uRegMSR = inpw(REG_UART0_MSR + uOffset);
    if(_uart_cHWTXStopped) {
        if(!(uRegMSR & 0x10)) { /* CTS high, external signal is low */
            _uart_cHWTXStopped = 0;
            FDEBUG("H/W flow control ...\n");

            /* 2007.11.12 modify, PT23 HHWu */
            if(dev->uUartTxHead != dev->uUartTxTail) {  /* buffer is not empty */
                _uartEnableInterrupt(nNum, UART_IER_THRE_IEN_Msk);  /* enable TX empty interrupt */
                FDEBUG("buf not empty, TX continued\n");
            }
        }
    } else {
        if( !(uRegMSR & 0x10) ) { /* CTS low, external signal is high */
            _uart_cHWTXStopped = 1;
            _uartDisableInterrupt(nNum, UART_IER_THRE_IEN_Msk);  /* disable TX empty interrupt */
            FDEBUG("H/W flow control, TX stopped\n");
        }
    }
}

static INT _uartSetBaudRate(INT nNum, UART_T *val)
{
    UINT32 u32Reg;
    UINT32 uOffset = nNum * UARTOFFSET;
    UINT32 u32Baud_Div;
    UINT32 u32Clk = val->uFreq;
    UINT32 u32baudrate = val->uBaudRate;

    //if (val->uFreq > 200000000)  /* Max frequency 200MHz */
    //  return -1;

    u32Baud_Div = UART_BAUD_MODE2_DIVIDER(u32Clk, u32baudrate);

    if(u32Baud_Div > 0xFFFF)
        u32Reg = (UART_BAUD_MODE0 | UART_BAUD_MODE0_DIVIDER(u32Clk, u32baudrate));
    else
        u32Reg = (UART_BAUD_MODE2 | u32Baud_Div);

    outpw(REG_UART0_BAUD + uOffset, u32Reg);

    return 0;
}

static void _uartInstallISR(UINT8 ucNum)
{
    UART_BUFFER_T *dev;

    IRQn_Type IRQ;

    dev = (UART_BUFFER_T *) &UART_DEV[ucNum];

    if(ucNum == UART0) {
        IRQ= UART0_IRQn;
        dev->pvUartVector = sysInstallISR((IRQ_LEVEL_1 | HIGH_LEVEL_SENSITIVE), IRQ, (PVOID)uart0ISR);
    } else if(ucNum == UART1) {
        IRQ= UART1_IRQn;
        dev->pvUartVector = sysInstallISR((IRQ_LEVEL_1 | HIGH_LEVEL_SENSITIVE), IRQ, (PVOID)uart1ISR);
    } else if(ucNum == UART2) {
        IRQ= UART2_IRQn;
        dev->pvUartVector = sysInstallISR((IRQ_LEVEL_1 | HIGH_LEVEL_SENSITIVE), IRQ, (PVOID)uart2ISR);
    } else if(ucNum == UART3) {
        IRQ= UART3_IRQn;
        dev->pvUartVector = sysInstallISR((IRQ_LEVEL_1 | HIGH_LEVEL_SENSITIVE), IRQ, (PVOID)uart3ISR);
    } else if(ucNum == UART4) {
        IRQ= UART4_IRQn;
        dev->pvUartVector = sysInstallISR((IRQ_LEVEL_1 | HIGH_LEVEL_SENSITIVE), IRQ, (PVOID)uart4ISR);
    } else if(ucNum == UART5) {
        IRQ= UART5_IRQn;
        dev->pvUartVector = sysInstallISR((IRQ_LEVEL_1 | HIGH_LEVEL_SENSITIVE), IRQ, (PVOID)uart5ISR);
    } else if(ucNum == UART6) {
        IRQ= UART6_IRQn;
        dev->pvUartVector = sysInstallISR((IRQ_LEVEL_1 | HIGH_LEVEL_SENSITIVE), IRQ, (PVOID)uart6ISR);
    } else if(ucNum == UART7) {
        IRQ= UART7_IRQn;
        dev->pvUartVector = sysInstallISR((IRQ_LEVEL_1 | HIGH_LEVEL_SENSITIVE), IRQ, (PVOID)uart7ISR);
    } else if(ucNum == UART8) {
        IRQ= UART8_IRQn;
        dev->pvUartVector = sysInstallISR((IRQ_LEVEL_1 | HIGH_LEVEL_SENSITIVE), IRQ, (PVOID)uart8ISR);
    } else if(ucNum == UART9) {
        IRQ= UART9_IRQn;
        dev->pvUartVector = sysInstallISR((IRQ_LEVEL_1 | HIGH_LEVEL_SENSITIVE), IRQ, (PVOID)uart9ISR);
    } else if(ucNum == UARTA) {
        IRQ= UART10_IRQn;
        dev->pvUartVector = sysInstallISR((IRQ_LEVEL_1 | HIGH_LEVEL_SENSITIVE), IRQ, (PVOID)uart10ISR);
    } else {
        return;
    }

    //dev->pvUartVector = sysInstallISR((IRQ_LEVEL_1 | HIGH_LEVEL_SENSITIVE), IRQ, (PVOID)pvNewISR);
    sysSetLocalInterrupt(ENABLE_IRQ);                            /* enable CPSR I bit */
    sysEnableInterrupt(IRQ);
    //DrvUART_EnableInt(TEST_PORT,(DRVUART_RLSINT|DRVUART_THREINT|DRVUART_RDAINT));


}

static BOOL _uartBUFSpaceAlloc(INT nNum)
{
    UART_BUFFER_T *dev;

    dev = (UART_BUFFER_T *) &UART_DEV[nNum];

    /* Memory allocate Tx buffer */
    dev->pucUartTxBuf = (PUINT8) malloc(UARTTXBUFSIZE[nNum] * sizeof(UINT8));
    if(dev->pucUartTxBuf == NULL)
        return FALSE;

    /* Memory allocate Rx buffer */
    dev->pucUartRxBuf = (PUINT8) malloc(UARTRXBUFSIZE[nNum] * sizeof(UINT8));
    if(dev->pucUartRxBuf == NULL) {
        free(dev->pucUartTxBuf);
        return FALSE;
    }

    /* Memory allocate Rx character flag */
    dev->pucUARTFlag = (PINT) malloc(UARTRXBUFSIZE[nNum] * sizeof(INT));
    if(dev->pucUARTFlag == NULL) {
        free(dev->pucUartTxBuf);
        free(dev->pucUartRxBuf);
        return FALSE;
    }

    /* initial memory */
    memset(dev->pucUartTxBuf, 0, UARTTXBUFSIZE[nNum] * sizeof(UINT8));
    memset(dev->pucUartRxBuf, 0, UARTRXBUFSIZE[nNum] * sizeof(UINT8));
    memset(dev->pucUARTFlag, 0, UARTRXBUFSIZE[nNum] * sizeof(INT));

    /* inital struct UART_BUFFER_STRUCT, uUartTxHead, uUartTxTail, uUartRxHead, uUartRxTail */
    dev->uUartTxHead = dev->uUartTxTail = (UINT32)NULL;
    dev->uUartRxHead = dev->uUartRxTail = (UINT32)NULL;

    return TRUE;
}

static BOOL _uartCheckTxBufSpace(INT nNum, UINT32 uHead, UINT32 uTail, UINT32 uLen)
{
    UINT32 uBuf;

    uBuf = _uartTxBufGetNextOne(nNum, uTail);
    if(uBuf == uHead)   /* Tx buffer full */
        return FALSE;

    if(uHead == uTail)  /* Tx buffer empty */
        return TRUE;

    if(uTail > uHead) {
        if(uLen >= (UARTTXBUFSIZE[nNum]-(uTail-uHead)))  /* 2007.10.29 fix pointer bug, PT23 HHWu */
            return FALSE;  /* Tx buffer space isn't enough */
        else
            return TRUE;
    } else {
        /* case: uTail < uHead */
        if(uLen >= (uHead-uTail))  /* 2007.10.29 fix pointer bug, PT23 HHWu */
            return FALSE;  /* Tx buffer space isn't enough */
        else
            return TRUE;
    }

    //return TRUE;
}

static INT32 _uartReadRxBuf(INT nNum, PUINT8 pucBuf, UINT32 uLen)
{
    UINT32 i;
    UINT32 uOffset = nNum * UARTOFFSET;
    UART_BUFFER_T *dev;

