OpenNuvoton/NUC970_NonOS_BSP/Driver/Source/uart.c
    dev = (UART_BUFFER_T *) &UART_DEV[nNum];

    if(dev->bIsUseUARTRxInt == TRUE) {

        // disable Rx interrupt ...

        if(dev->uUartRxHead == dev->uUartRxTail)
            return 0;

        for(i = uLen ; i > 0 ; i--) {
            *pucBuf++ = dev->pucUartRxBuf[dev->uUartRxHead];
            dev->uUartRxHead = _uartRxBufGetNextOne(nNum, dev->uUartRxHead);

            if(dev->uUartRxHead == dev->uUartRxTail)
                break;
        }

        uLen = uLen-i+1;
    } else { /* pooling mode */
        for(i = 0 ; i < uLen; i++) {
            while(!(inpw(REG_UART0_FSR+uOffset) & UART_FSR_RX_EMPTY_Msk));
            *pucBuf++ = inpb(REG_UART0_RBR+uOffset);
        }
    }

    return (uLen);
}

static void _uartWriteTxBuf(INT nNum, PUINT8 pucBuf, UINT32 uLen)
{
    UINT32 i;
    UINT32 uOffset = nNum * UARTOFFSET;
    UART_BUFFER_T *dev;

    dev = (UART_BUFFER_T *) &UART_DEV[nNum];

    /* Check interrupt or polling mode first */
    if(dev->bIsUseUARTTxInt == TRUE) {
        while(uLen--) {
            dev->pucUartTxBuf[dev->uUartTxTail] = *pucBuf++;
            dev->uUartTxTail = _uartTxBufGetNextOne(nNum, dev->uUartTxTail);
        }

        if (!(inpw(REG_UART0_IER+uOffset) & UART_IER_THRE_IEN_Msk))  /* Enable Tx empty interrupt */
            _uartEnableInterrupt(nNum, UART_IER_THRE_IEN_Msk);
    } else { /* pooling mode */
        for(i = 0 ; i < uLen ; i++) {
            /* Wait until the transmitter buffer is empty */
            while(!(inpw(REG_UART0_FSR+uOffset) & UART_FSR_TE_FLAG_Msk));
            outpw(REG_UART0_THR+uOffset, *pucBuf++);
        }
    }
}

static INT _uartConfigureUART(PVOID pvParam)
{
    INT retval;
    BOOL bIsMemoryAllocOk;
    UINT32 u32Reg;
    UINT32 uOffset;
    UINT32 uNum=0;

    UART_T *param = (UART_T *) pvParam;

    uOffset = param->ucUartNo * UARTOFFSET;
    uNum = param->ucUartNo;

    /* Check UART channel */
    if ( uNum > UARTA )
        return UART_ERR_CHANNEL_INVALID;

    /* Check the supplied parity */
    if ( (param->ucParity != PARITY_NONE) &&
         (param->ucParity != PARITY_EVEN) &&
         (param->ucParity != PARITY_ODD)  &&
         (param->ucParity != (PARITY_ODD | PARITY_STICK)) &&
         (param->ucParity != (PARITY_EVEN | PARITY_STICK)) )
        return UART_ERR_PARITY_INVALID;

    /* Check the supplied number of data bits */
    if ( (param->ucDataBits != DATA_BITS_5) &&
         (param->ucDataBits != DATA_BITS_6) &&
         (param->ucDataBits != DATA_BITS_7) &&
         (param->ucDataBits != DATA_BITS_8) )
        return UART_ERR_DATA_BITS_INVALID;

    /* Check the supplied number of stop bits */
    if ( (param->ucStopBits != STOP_BITS_1) &&
         (param->ucStopBits != STOP_BITS_2) )
        return UART_ERR_STOP_BITS_INVALID;

    /* Check the supplied number of trigger level bytes */
    if ( (param -> ucUartNo == UART1) || (param -> ucUartNo == UART2) || (param -> ucUartNo == UART4) ||
         (param -> ucUartNo == UART6) || (param -> ucUartNo == UART8) || (param -> ucUartNo == UARTA)) {
        /* UART1,2,4,6,8,A */
        if ( (param->ucRxTriggerLevel != UART_FCR_RFITL_1BYTE)   &&
             (param->ucRxTriggerLevel != UART_FCR_RFITL_4BYTES)  &&
             (param->ucRxTriggerLevel != UART_FCR_RFITL_8BYTES)  &&
             (param->ucRxTriggerLevel != UART_FCR_RFITL_14BYTES) &&
             (param->ucRxTriggerLevel != UART_FCR_RFITL_30BYTES) &&
             (param->ucRxTriggerLevel != UART_FCR_RFITL_46BYTES) &&
             (param->ucRxTriggerLevel != UART_FCR_RFITL_62BYTES) )
            return UART_ERR_TRIGGERLEVEL_INVALID;
    } else {
        /* UART0,3,5,7,9 */
        if ( (param->ucRxTriggerLevel != UART_FCR_RFITL_1BYTE)  &&
             (param->ucRxTriggerLevel != UART_FCR_RFITL_4BYTES) &&
             (param->ucRxTriggerLevel != UART_FCR_RFITL_8BYTES) &&
             (param->ucRxTriggerLevel != UART_FCR_RFITL_30BYTES) )
            return UART_ERR_TRIGGERLEVEL_INVALID;
    }

    /* Enable UART clock */
    if(param->ucUartNo < ALLCHANNEL) {
        outpw(REG_CLK_PCLKEN0, inpw(REG_CLK_PCLKEN0) | (1 << (16+param->ucUartNo)) );
    }

    /* Reset TX/RX FIFOs */
    u32Reg = inpw(REG_UART0_FCR+uOffset);
    outpw(REG_UART0_FCR+uOffset, (u32Reg | (0x03 << 1)) );

    /* Setup baud rate */
    retval = _uartSetBaudRate(param->ucUartNo, param);
    if (retval < 0)
        return UART_ERR_SET_BAUDRATE_FAIL;

    /* Setup parity, data bits, and stop bits */
    outpw(REG_UART0_LCR+uOffset, (param->ucParity | param->ucDataBits | param->ucStopBits));

    /* Setup Rx time out value */
    outpw(REG_UART0_TOR+uOffset, 0x80+0x20);

    /* Setup FIFO trigger level */
    outpw(REG_UART0_FCR+uOffset, param->ucRxTriggerLevel);

    /* only exec once unless call uartClose() */
    if(UART_DEV[param->ucUartNo].bIsUARTInitial == FALSE) {
        /* Configure GPIO function */
        //_uartConfigureGPIO(param->ucUartNo);

        /* Allocate Tx, Rx buffer */
        bIsMemoryAllocOk = _uartBUFSpaceAlloc(param->ucUartNo);
        if(bIsMemoryAllocOk == FALSE)
            return UART_ERR_ALLOC_MEMORY_FAIL;

        /* Hook UART interrupt service routine */
        _uartInstallISR(param->ucUartNo);

        /* Enable Rx interrupt */
        if(UART_DEV[param->ucUartNo].bIsUseUARTRxInt == TRUE)
            _uartEnableInterrupt(param->ucUartNo, UART_IER_RDA_IEN_Msk);

    }

    UART_DEV[param->ucUartNo].bIsUARTInitial = TRUE;  /* it's important to set TRUE */
    return 0;
}

static INT _uartPerformIrDA(INT nNum, UINT32 uCmd, UINT32 uCmd1)  /* UART2 only */
{
    UINT32 uOffset = nNum * UARTOFFSET;
    UINT32 baud;

    switch(uCmd) {
        case ENABLEIrDA:
            //_uart_bIsPerformIrDA = TRUE;

            baud = inpw(REG_UART0_BAUD+uOffset);
            baud = baud & (0x0000ffff);
            baud = baud + 2;
            baud = baud / 16;
            baud = baud - 2;

            outpw(REG_UART0_BAUD+uOffset, baud);

            if(uCmd1 == IrDA_TX)
                outpw(REG_UART0_IRCR+uOffset, UART_IRCR_TX_SELECT_Msk);
            else if(uCmd1 == IrDA_RX)
                outpw(REG_UART0_IRCR+uOffset, 0x0);
            else
                return UART_ERR_IrDA_COMMAND_INVALID;

            outpw(REG_UART0_FUN_SEL+uOffset, 0x2); // Select IrDA mode

            break;

