OpenNuvoton/NUC970_NonOS_BSP/Driver/Source/uart.c
        case DISABLEIrDA:
            //_uart_bIsPerformIrDA = FALSE;
            outpw(REG_UART0_IRCR+uOffset, 0x40);  /* Set default value, INV_TX set 0, INV_RX set 1 */
            outpw(REG_UART0_FUN_SEL+uOffset, 0x0); // Select UART mode
            break;

        default:
            return UART_ERR_IrDA_COMMAND_INVALID;
    }

    return 0;
}

/*
    Remark:
    1. LCR & LSR aren't support yet.
*/
static INT _uartGetRegisterValue(INT nNum, PVOID pvReg)
{
    INT nCnt = 0;
    UINT32 uOffset = nNum * UARTOFFSET;

    UART_REGISTER_T *reg = (UART_REGISTER_T *) pvReg;

    memset(reg, 0, sizeof(UART_REGISTER_T));

    /* Read IER */
    reg->uUartReg[nCnt][0] = REG_UART0_IER + uOffset;
    reg->uUartReg[nCnt++][1] = inpw(REG_UART0_IER + uOffset);

    /* Read FCR */
    reg->uUartReg[nCnt][0] = REG_UART0_FCR + uOffset;
    reg->uUartReg[nCnt++][1] = inpw(REG_UART0_FCR + uOffset);

    /* Read LCR */
    reg->uUartReg[nCnt][0] = REG_UART0_LCR + uOffset;
    reg->uUartReg[nCnt++][1] = inpw(REG_UART0_LCR + uOffset);

    /* Read MCR, MSR */
    reg->uUartReg[nCnt][0] = REG_UART0_MCR + uOffset;
    reg->uUartReg[nCnt++][1] = inpw(REG_UART0_MCR + uOffset);
    reg->uUartReg[nCnt][0] = REG_UART0_MSR + uOffset;
    reg->uUartReg[nCnt++][1] = inpw(REG_UART0_MSR + uOffset);

    /* Read FSR */
    reg->uUartReg[nCnt][0] = REG_UART0_FSR + uOffset;
    reg->uUartReg[nCnt++][1] = inpw(REG_UART0_FSR + uOffset);

    /* Read ISR */
    reg->uUartReg[nCnt][0] = REG_UART0_ISR + uOffset;
    reg->uUartReg[nCnt++][1] = inpw(REG_UART0_ISR + uOffset);

    /* Read TOR */
    reg->uUartReg[nCnt][0] = REG_UART0_TOR + uOffset;
    reg->uUartReg[nCnt++][1] = inpw(REG_UART0_TOR + uOffset);

    /* Read BAUD */
    reg->uUartReg[nCnt][0] = REG_UART0_BAUD + uOffset;
    reg->uUartReg[nCnt++][1] = inpw(REG_UART0_BAUD + uOffset);

    /* Read IRCR */
    reg->uUartReg[nCnt][0] = REG_UART0_IRCR + uOffset;
    reg->uUartReg[nCnt++][1] = inpw(REG_UART0_IRCR + uOffset);

    /* Read ALT_CSR */
    reg->uUartReg[nCnt][0] = REG_UART0_ALT_CSR + uOffset;
    reg->uUartReg[nCnt++][1] = inpw(REG_UART0_ALT_CSR + uOffset);

    /* Read FUN_SEL */
    reg->uUartReg[nCnt][0] = REG_UART0_FUN_SEL + uOffset;
    reg->uUartReg[nCnt++][1] = inpw(REG_UART0_FUN_SEL + uOffset);

    /* Read LIN_CTL */
    reg->uUartReg[nCnt][0] = REG_UART0_LIN_CTL + uOffset;
    reg->uUartReg[nCnt++][1] = inpw(REG_UART0_LIN_CTL + uOffset);

    /* Read LIN_SR */
    reg->uUartReg[nCnt][0] = REG_UART0_LIN_SR + uOffset;
    reg->uUartReg[nCnt++][1] = inpw(REG_UART0_LIN_SR + uOffset);

    return (nCnt);
}

/// @endcond HIDDEN_SYMBOLS

/** @addtogroup NUC970_UART_EXPORTED_FUNCTIONS UART Exported Functions
  @{
*/

/**
  * @brief    The function is used to initial device struct parameters.
  *
  * @return   0
  */
INT uartInit(void)
{
    INT i;

    /* Initial UART_BUFFER_T struct */
    for(i = 0; i < UART_NUM ; i++)
        UART_DEV[i].bIsUARTInitial = FALSE;

    for(i = 0; i < UART_NUM ; i++)
        UART_DEV[i].bIsUseUARTTxInt = TRUE;

    for(i = 0; i < UART_NUM ; i++)
        UART_DEV[i].bIsUseUARTRxInt = TRUE;

    return 0;
}

/**
  * @brief    The function is used to config UART channel.
  *
  * @param[in]    uart: UART Port. ( UART0 / UART1 / UART2 / UART3 / UART 4 /UART 5 /
  *                                 UART6 / UART7 / UART8 / UART9 / UARTA )
  *
  * @return   UART_EIO: UART config Fail
  *           Successful: UART config success
  */
INT uartOpen(PVOID uart)
{
    INT nValue = 0;
    UART_T *dev = (UART_T *) uart;

    if((nValue = _uartConfigureUART(uart)) < 0) {
        if(nValue != UART_ERR_CHANNEL_INVALID)
            UART_DEV[dev->ucUartNo].nErrno = nValue;

        return UART_EIO;
    } else
        UART_DEV[dev->ucUartNo].nErrno = 0;

    return Successful;
}

/**
  * @brief    The function is used to read RX FIFO returned data or RX driver buffer.
  *
  * @param[in]    nNum: UART Port. ( UART0 / UART1 / UART2 / UART3 / UART 4 /UART 5 /
  *                                 UART6 / UART7 / UART8 / UART9 / UARTA )
  * @param[out]   pucBuf: The buffer to receive.
  *
  * @param[in]    uLen: The the read bytes number of data.
  *
  * @return   UART_EIO: UART read Fail
  *           DataLength: Receive byte count
  */
INT32 uartRead(INT nNum, PUINT8 pucBuf, UINT32 uLen)
{
    UART_BUFFER_T *dev;
    INT32 DataLength;

    //if((nNum < UART0) || (nNum > UART4))
    //  return UART_ENODEV;

    dev = (UART_BUFFER_T *) &UART_DEV[nNum];

    /* Check UART initial status */
    if(dev->bIsUARTInitial == FALSE)
        return UART_EIO;

    /* Check uLen value */
    if((uLen > UARTRXBUFSIZE[nNum]) || (uLen == 0))
        return UART_EIO;

    DataLength = _uartReadRxBuf(nNum, pucBuf, uLen);

    return (DataLength);

}


/**
  * @brief    The function is used to write data to TX FIFO directly or TX driver buffer.
  *
  * @param[in]    nNum: UART channel. ( UART0 / UART1 / UART2 / UART3 / UART 4 /UART 5 /
  *                                     UART6 / UART7 / UART8 / UART9 / UARTA )
  * @param[out]   pucBuf: Transmit buffer pointer.
  *
  * @param[in]    uLen: Transmit buffer length.
  *
  * @return   UART_EIO: UART transmit Fail
  *           uLen: write length on success
  */
INT32 uartWrite(INT nNum, PUINT8 pucBuf, UINT32 uLen)
{
    BOOL bIsTxBufEnough;

    UART_BUFFER_T *dev;

    //if((nNum < UART0) || (nNum > UART4))
    //  return UART_ENODEV;

    dev = (UART_BUFFER_T *) &UART_DEV[nNum];
    dev->nErrno = 0;

    /* Check UART initial status */
    if(dev->bIsUARTInitial == FALSE)
        return UART_EIO;

    /* Check uLen value */
    if((uLen > UARTWRITESIZE) || (uLen == 0))
        return UART_EIO;

    /* Check UART Tx buffer */
    if(dev->bIsUseUARTTxInt == TRUE) {
        bIsTxBufEnough = _uartCheckTxBufSpace(nNum, dev->uUartTxHead, dev->uUartTxTail, uLen);
        if(bIsTxBufEnough == FALSE) {
            //sysprintf("Tx buf not enough\n");
            dev->nErrno = UART_ERR_TX_BUF_NOT_ENOUGH;
            return UART_EIO;
        }
    }

