OpenNuvoton/NUC970_NonOS_BSP/Driver/Source/uart.c
    /* Move data to UART Tx buffer then transmit */
    _uartWriteTxBuf(nNum, pucBuf, uLen);

    return (uLen);
}

/**
  * @brief    Support some UART driver commands for application.
  *
  * @param[in]    nNum: UART channel. ( UART0 / UART1 / UART2 / UART3 / UART 4 /UART 5 /
  *                                     UART6 / UART7 / UART8 / UART9 / UARTA )
  *
  * @param[in]    uCmd: Command.
  *
  * @param[in]    uArg0: Arguments for the command.
  *
  * @param[in]    uArg1: Arguments for the command.
  *
  * @return   UART_ENODEV: UART channel out of range
  *           UART_EIO: No activated or argument error or configure UART fail
  *           Successful: Success
  */
INT uartIoctl(INT nNum, UINT32 uCmd, UINT32 uArg0, UINT32 uArg1)
{
    INT32 retval;
    UINT32 uReg;
    UINT32 uOffset = nNum * UARTOFFSET;

    UART_BUFFER_T *dev;

    if((nNum < UART0) || (nNum > UARTA))
        return UART_ENODEV;

    dev = (UART_BUFFER_T *) &UART_DEV[nNum];

    /* Check UART initial status */
    if(dev->bIsUARTInitial == FALSE) {
        if((uCmd != UART_IOC_GETERRNO) &&
           (uCmd != UART_IOC_GETUARTREGISTERVALUE))
            return UART_EIO;
    }

    switch(uCmd) {
        case UART_IOC_SETTXMODE:
            if(uArg0 == UARTINTMODE)
                dev->bIsUseUARTTxInt = TRUE;
            else if(uArg0 == UARTPOLLMODE)
                dev->bIsUseUARTTxInt = FALSE;
            else {
                dev->nErrno = UART_ERR_OPERATE_MODE_INVALID;
                return UART_EIO;
            }

            break;

        case UART_IOC_SETRXMODE:
            if(uArg0 == UARTINTMODE) {
                dev->bIsUseUARTRxInt = TRUE;
                _uartEnableInterrupt(nNum, UART_IER_RDA_IEN_Msk);
            } else if(uArg0 == UARTPOLLMODE) {
                dev->bIsUseUARTRxInt = FALSE;
                _uartDisableInterrupt(nNum, UART_IER_RDA_IEN_Msk);
            } else {
                dev->nErrno = UART_ERR_OPERATE_MODE_INVALID;
                return UART_EIO;
            }

            break;

        case UART_IOC_GETRECCHARINFO:  // ..... not test yet
            memcpy((PVOID) uArg0, (PVOID) dev, sizeof(struct UART_BUFFER_STRUCT));
            break;

        case UART_IOC_SETUARTPARAMETER:  // ..... not test yet
            if((retval = _uartConfigureUART((PVOID) uArg0)) < 0) {
                dev->nErrno = retval;
                return UART_EIO;
            }

            break;

        case UART_IOC_PERFORMIrDA:

            if((retval = _uartPerformIrDA(nNum, uArg0, uArg1)) < 0) {
                dev->nErrno = retval;
                return UART_EIO;
            }

            break;

        case UART_IOC_GETUARTREGISTERVALUE:
            return (_uartGetRegisterValue(nNum, (PVOID) uArg0));
        //break;

        case UART_IOC_GETERRNO:
            *(PUINT32)uArg0 = dev->nErrno;
            break;

        case UART_IOC_SETMODEMINTERRUPT:

            if(uArg0 == UART_ENABLE_MODEM_INT)
                _uartEnableInterrupt(nNum, UART_IER_MODEM_IEN_Msk);
            else if(uArg0 == UART_DISABLE_MODEM_INT)
                _uartDisableInterrupt(nNum, UART_IER_MODEM_IEN_Msk);
            else
                return UART_EIO;

            break;

        case UART_IOC_GETCTSSTATE:

            if(nNum == UART1) {
                *(PUINT32)uArg0 = _uart_cCTSState1;                        /* CTS state */
                _uart_cCTSState1 = 0;
            } else if(nNum == UART2) {
                *(PUINT32)uArg0 = _uart_cCTSState2;                        /* CTS state */
                _uart_cCTSState2 = 0;
            } else if(nNum == UART3) {
                *(PUINT32)uArg0 = _uart_cCTSState3;                        /* CTS state */
                _uart_cCTSState3 = 0;
            } else if(nNum == UART4) {
                *(PUINT32)uArg0 = _uart_cCTSState4;                        /* CTS state */
                _uart_cCTSState4 = 0;
            } else if(nNum == UART5) {
                *(PUINT32)uArg0 = _uart_cCTSState5;                        /* CTS state */
                _uart_cCTSState5 = 0;
            } else if(nNum == UART6) {
                *(PUINT32)uArg0 = _uart_cCTSState6;                        /* CTS state */
                _uart_cCTSState6 = 0;
            } else if(nNum == UART7) {
                *(PUINT32)uArg0 = _uart_cCTSState7;                        /* CTS state */
                _uart_cCTSState7 = 0;
            } else if(nNum == UART8) {
                *(PUINT32)uArg0 = _uart_cCTSState8;                        /* CTS state */
                _uart_cCTSState8 = 0;
            } else if(nNum == UART9) {
                *(PUINT32)uArg0 = _uart_cCTSState9;                        /* CTS state */
                _uart_cCTSState9 = 0;
            } else if(nNum == UARTA) {
                *(PUINT32)uArg0 = _uart_cCTSState10;                        /* CTS state */
                _uart_cCTSState10 = 0;
            }

            *(PUINT32)uArg1 = (inpw(REG_UART0_MSR+uOffset) & (1 << 4)) >> 4;  /* get CTS# value */

            break;

        case UART_IOC_SETRTSSIGNAL:

            if(uArg0 == UART_RTS_HIGH)      /* set RTS signal high */
                outpw(REG_UART0_MCR+uOffset, inpw(REG_UART0_MCR+uOffset) & ~0x02);
            else if(uArg0 == UART_RTS_LOW)  /* set RTS signal low  */
                outpw(REG_UART0_MCR+uOffset, inpw(REG_UART0_MCR+uOffset) | 0x02);
            else
                return UART_EIO;

            break;

        case UART_IOC_SETINTERRUPT:
            if(uArg0 == 1)       /* enable interrupt  */
                _uartEnableInterrupt(nNum, uArg1);
            else if(uArg0 == 0)  /* disable interrupt */
                _uartDisableInterrupt(nNum, uArg1);
            else
                return UART_EIO;

            break;

        case UART_IOC_SETBREAKCONTROL:
            uReg = inpw(REG_UART0_LCR + uOffset);
            if(uArg0 == 1) {     /* set break contorl bit  */
                uReg |= UART_LCR_BCB_Msk;
                outpw(REG_UART0_LCR + uOffset, uReg);
            } else if(uArg0 == 0) { /* clear break contorl bit */
                uReg &= ~UART_LCR_BCB_Msk;
                outpw(REG_UART0_LCR + uOffset, uReg);
            } else
                return UART_EIO;

            break;

        case UART_IOC_GETBIISTATE:
            switch(nNum) {
                case UART0:
                    *(PUINT32)uArg0 = _uart_cBIIState_0;
                    break;
                case UART1:
                    *(PUINT32)uArg0 = _uart_cBIIState_1;
                    break;
                case UART2:
                    *(PUINT32)uArg0 = _uart_cBIIState_2;
                    break;
                case UART3:
                    *(PUINT32)uArg0 = _uart_cBIIState_3;
                    break;
                case UART4:
                    *(PUINT32)uArg0 = _uart_cBIIState_4;
                    break;
                case UART5:
                    *(PUINT32)uArg0 = _uart_cBIIState_5;
                    break;
                case UART6:
                    *(PUINT32)uArg0 = _uart_cBIIState_6;
                    break;
                case UART7:
                    *(PUINT32)uArg0 = _uart_cBIIState_7;
                    break;
                case UART8:
                    *(PUINT32)uArg0 = _uart_cBIIState_8;
                    break;
                case UART9:
                    *(PUINT32)uArg0 = _uart_cBIIState_9;
                    break;
                case UARTA:
                    *(PUINT32)uArg0 = _uart_cBIIState_10;
                    break;

                default:
                    break;
            }
            break;

        /* H/W S/W flow control function */
        case UART_IOC_ENABLEHWFLOWCONTROL:

            /* H/W & S/W are alternative */
            if(_uart_cFlowControlMode == SWFLOWCONTROL)
                return UART_EIO;

