OpenNuvoton/NUC970_NonOS_BSP/Driver/Source/uart.c
            _uart_cFlowControlMode = HWFLOWCONTROL;

            /* Implement H/W flow control on TX & RX interrupt mode. */
            //dev->bIsUseUARTTxInt = TRUE;
            //dev->bIsUseUARTRxInt = TRUE;
            _uartEnableInterrupt(nNum, UART_IER_RDA_IEN_Msk);

            /*
                Set up RTS mechanism.
                In uartReceiveChars(), if uRecCnt >= _uart_nMaxRxBuf then set RTS high to stop RX.
                In uartReadRxBuf(), if uRecCnt <= _uart_nMinRxBuf then set RTS low to re-start RX.
            */
            //_uart_nMaxRxBuf = (UARTRXBUFSIZE[nNum] * 3) / 4;
            //_uart_nMinRxBuf = UARTRXBUFSIZE[nNum] / 2;
            //FDEBUG("max[%d] min[%d]\n", _uart_nMaxRxBuf, _uart_nMinRxBuf);

            /* Set RTS high level trigger */
            outpw(REG_UART0_MCR+uOffset, (inpw(REG_UART0_MCR+uOffset) | UART_RTS_IS_HIGH_LEV_TRG) );
            /* Set RTS high level trigger */
            outpw(REG_UART0_MSR+uOffset, (inpw(REG_UART0_MSR+uOffset) | UART_CTS_IS_HIGH_LEV_TRG) );

            /* Set Auto CTS/RTS */
            outpw(REG_UART0_IER+uOffset, inpw(REG_UART0_IER+uOffset) | (0x3 << 12));

            /* Enable MODEM status interrupt */
            //_uartEnableInterrupt(nNum, UART_IER_MODEM_IEN_Msk);

            /*
                Maintain H/W flow control flag by read Modem Status Register.
                If CTS high, stop TX.
                If CTS low, start TX.
            */
            //if( inpw(REG_UART0_MSR+uOffset) & 0x10 )  /* CTS external signal is low  */
            //  _uart_cHWTXStopped = 0;       /* TX started                  */
            //else                              /* CTS external signal is high */
            //  _uart_cHWTXStopped = 1;       /* TX stopped                  */

            /* Set RTS as logic 0, RX re-start */
            //outpb(REG_UART0_MCR+uOffset, inpb(REG_UART0_MCR+uOffset) | 0x02);  /* set RTS signal low  */
            //_uart_cHWRXStopped = 0;  // RX started
            break;

        case UART_IOC_DISABLEHWFLOWCONTROL:

            /* Disable MODEM status interrupt */
            _uartDisableInterrupt(nNum, UART_IER_MODEM_IEN_Msk);
            _uart_cFlowControlMode = 0;
            _uart_cHWTXStopped = 0;
            _uart_cHWRXStopped = 0;
            break;

        case UART_IOC_FLUSH_TX_BUFFER:
            dev->uUartTxTail = 0;
            dev->uUartTxHead = 0;
            break;

        case UART_IOC_FLUSH_RX_BUFFER:
            dev->uUartRxTail = 0;
            dev->uUartRxHead = 0;
            break;

        case UART_IOC_SET_RS485_MODE:
            outpw((REG_UART0_FUN_SEL+uOffset), 0x3);
            outpw((REG_UART0_MCR+uOffset), 0x0);
            outpw((REG_UART0_LCR+uOffset), (UART_LCR_SPE_Msk | UART_LCR_EPE_Msk | UART_LCR_PBE_Msk | (0x3 << UART_LCR_WLS_Pos)));
            outpw((REG_UART0_ALT_CSR+uOffset), uArg0|(uArg1 << UART_ALT_CSR_ADDR_MATCH_Pos));
            break;

        case UART_IOC_SEND_RS485_ADDRESS:

            while(!((inpw(REG_UART0_FSR + uOffset)) & UART_FSR_TE_FLAG_Msk));
            uReg = inpw(REG_UART0_LCR + uOffset);
            outpw((REG_UART0_LCR+uOffset), (UART_LCR_SPE_Msk | UART_LCR_PBE_Msk | (0x3 << UART_LCR_WLS_Pos)));
            outpw((REG_UART0_THR+uOffset), uArg0);
            while(!((inpw(REG_UART0_FSR + uOffset)) & UART_FSR_TE_FLAG_Msk));

            outpw((REG_UART0_LCR+uOffset), uReg);

            break;

        case UART_IOC_SET_RS485_RXOFF:
            uReg = inpw(REG_UART0_FCR + uOffset);
            if(uArg0 == 1)
                uReg |= UART_FCR_RX_DIS_Msk;
            else
                uReg &= ~UART_FCR_RX_DIS_Msk;

            outpw((REG_UART0_FCR + uOffset), uReg);

            break;

        case UART_IOC_SET_ALTCTL_REG:

            outpw((REG_UART0_ALT_CSR + uOffset), uArg0);

            break;

        case UART_IOC_GET_ALTCTL_REG:

            *(PUINT32)uArg0 = inpw(REG_UART0_ALT_CSR + uOffset);

            break;

        case UART_IOC_SET_LIN_MODE:

            outpw((REG_UART0_FUN_SEL+uOffset), 0x1); // Select LIN function

            /* Select LIN function setting : Tx enable, Rx enable and break field length */
            uReg = inpw(REG_UART0_ALT_CSR + uOffset);
            uReg &= ~(UART_ALT_CSR_LIN_TX_EN_Msk | UART_ALT_CSR_LIN_RX_EN_Msk | UART_ALT_CSR_UA_LIN_BKFL_Msk);
            uReg |= (uArg0 | (uArg1 << UART_ALT_CSR_UA_LIN_BKFL_Pos));
            outpw((REG_UART0_ALT_CSR + uOffset), uReg);

            break;

        default:
            return UART_ENOTTY;
    }

    return Successful;
}

/**
  * @brief    Release memory resource, disable interrupt.
  *
  * @param[in]    nNum: UART channel. ( UART0 / UART1 / UART2 / UART3 / UART 4 /UART 5 /
  *                                     UART6 / UART7 / UART8 / UART9 / UARTA )
  *
  * @return   UART_ENODEV: UART channel out of range
  *           UART_EIO: No activated
  *           Successful: Success
  */
INT32 uartRelease(INT nNum)
{
    UART_BUFFER_T *dev;

    if((nNum < UART0) || (nNum > UARTA))
        return UART_ENODEV;

    dev = (UART_BUFFER_T *) &UART_DEV[nNum];

    /* Check UART initial status */
    if(dev->bIsUARTInitial == FALSE)
        return UART_EIO;

    /* Disable all interrupt of the specific UART */
    _uartDisableInterrupt(nNum, DISABLEALLIER);

    /* Free memory */
    free(dev->pucUartTxBuf);
    free(dev->pucUartRxBuf);
    free(dev->pucUARTFlag);

    /* Initial parameter */
    dev->bIsUARTInitial = FALSE;  /* it's important */

    return Successful;
}

/*@}*/ /* end of group NUC970_UART_EXPORTED_FUNCTIONS */

/*@}*/ /* end of group NUC970_UART_Driver */

/*@}*/ /* end of group NUC970_Device_Driver */


/*** (C) COPYRIGHT 2015 Nuvoton Technology Corp. ***/

